Cases/palette/pallet_2x4_no_box/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    symmetryPlanePallet;
        type    faceZoneSet;
        action  new;
        source  searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface searchableBox;
            min (0 0 0);
            max (0 0.4 0.8);
        }
    }
    {
        name    symmetryPlanePallet;
        type    faceZoneSet;
        action  add;
        source  searchableSurfaceToFaceZone;
        sourceInfo
        {
            surface searchableBox;
            min (0 0 0);
            max (0.6 0 0.8);
        }
    }
    // {
    //     name    test;
    //     type    faceZoneSet;
    //     action  new;
    //     source  searchableSurfaceToFaceZone;
    //     sourceInfo
    //     {
    //         surface searchableBox;
    //         min (0 0 0);
    //         max (0.6 0.4 0);
    //     }
    // }
);

// ************************************************************************* //
